Tekla.Structures.Model.LoadLine
The LoadLine class defines a linearly-distributed force or torsion.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
public class Example
{
public void Example1()
{
LoadLine L = new LoadLine();
L.P1 = new Vector(0000,0000,-1000);
L.P2 = new Vector(0000,0000,-1000);
L.DistanceA = 5;
L.DistanceB = 6;
L.Torsion1 = 1000;
L.Torsion2 = 2000;
L.Position1 = new Point(3000,12000,0);
L.Position2 = new Point(4000,12000,0);
L.LoadForm = LoadLine.LineLoadFormEnum.LOAD_FORM_LINE_1;
L.AutomaticPrimaryAxisWeight = true;
L.BoundingBoxDx = 500;
L.BoundingBoxDy = 500;
L.BoundingBoxDz = 500;
L.LoadDispersionAngle = 5;
L.PartFilter = "testing";
L.PartNames = Load.LoadPartNamesEnum.LOAD_PART_NAMES_INCLUDE;
L.PrimaryAxisDirection = new Vector(1000, 500, 0);
L.Spanning = Load.LoadSpanningEnum.LOAD_SPANNING_SINGLE;
L.Weight = 2;
L.CreateFixedSupportConditionsAutomatically = true;
if (!L.Insert())
Console.WriteLine("LoadLine Insert failed!");
}
}

Tekla.Structures.Model.LoadLine.Position1
The first input position point.

Tekla.Structures.Model.LoadLine.Position2
The second input position point.

Tekla.Structures.Model.LoadLine.P1
The load magnitude vector at the start position.
The values are given in the local coordinate system of the load (not in the current coordinate system).

Tekla.Structures.Model.LoadLine.P2
The load magnitude vector at the end position.
The values are given in the local coordinate system of the load (not in the current coordinate system).

Tekla.Structures.Model.LoadLine.Torsion1
The first torsion.

Tekla.Structures.Model.LoadLine.Torsion2
The second torsion.

Tekla.Structures.Model.LoadLine.LoadForm
The load form.

Tekla.Structures.Model.LoadLine.DistanceA
The distance a (for shortening or dividing the length of a line load).

Tekla.Structures.Model.LoadLine.DistanceB
The distance b (for shortening or dividing the length of a line load).

Tekla.Structures.Model.LoadLine.#ctor
Creates a new load line instance.

Tekla.Structures.Model.LoadLine.Insert
Inserts the load line into the model database.
Returns: True on success.

Tekla.Structures.Model.LoadLine.Select
Selects a load line from the model database. The ID must be set.
Returns: True on success.

Tekla.Structures.Model.LoadLine.Modify
Modifies the existing load line in the model database to match the current one.
At the moment it is not possible to change the load attachment or the father.
Returns: True on success.

Tekla.Structures.Model.LoadLine.Delete
Deletes the load line instance with the given ID from the model database.
Returns: True on success.